package com.javarush.task.task01.task0138;


/*В методе main напиши код, чтобы в результате выполнения программы было выведено твое любимое стихотворение.
В стихотворении должно быть не меньше, чем 4 строчки. Не убирай вывод строчки "Мое любимое стихотворение:".

Требования:
•	Программа должна выводить текст.
•	Перед стихом должна быть выведена строка "Мое любимое стихотворение:".
•	Выводимый текст должен состоять не меньше, чем из пяти строк (пустые строки - это тоже строки).
•	В выводимом тексте должно быть не менее, чем 50 символов.*/


/* 
Любимое стихотворение
*/
// TODO: 31.01.2020 фантазии не хватило  
public class Solution {
    public static void main(String[] args) {
        System.out.println("Мое любимое стихотворение:");
        //напишите тут ваш код
        System.out.println ("Поучиться мне пора,");
        System.out.println ("вот я взялся за Java,");
        System.out.println ("кодить кодить мне пора ");
        System.out.println ("вот я взялся за Java!");
    }
}