package com.javarush.task.task01.task0135;

/*Выведи на экран переменные, значения которых являются названиями фруктов. Каждую переменную выведи с новой строки.

Требования:
•	Программа должна выводить текст.
•	Нельзя изменять строки с объявлением переменных.
•	Выводимый текст должен состоять из 2 строк.
•	Программа должна выводить переменные, значения которых являются названиями фруктов.
•	Программа не должна выводить переменные, значения которых не являются названиями фруктов.*/

/*
Выбирай здоровую еду! Выбирай фрукты!
*/

public class Solution {
    public static void main(String[] args) {
        String apple = "Яблоко";
        String porridge = "Каша";
        String sausage = "Колбаса";
        String peach = "Персик";

        //напишите тут ваш код
        System.out.println(apple);
        //Systme.out.println(s.porridge);
        //Systme.out.println(s.sausage);
        System.out.println(peach);
    }
}