package ru.progwards.task2;

public class Task2 {
    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        /*1. Реализовать функцию public static void printJava() в которой следует: создать три строковые переменные со значениями:
"Хорошо идут дела"
"Изучаю Java я!"
" "
вывести на консоль, используя только эти переменные и функции System.out.print(), System.out.println() следующий текст:
Хорошо идут дела
Изучаю Java я!
Хорошо идут дела Изучаю Java я!
Изучаю Java я! Хорошо идут дела*/
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    public static void printJava() {

        String str = "Хорошо идут дела";
        System.out.println(str);
        str = "Изучаю Java я!";
        System.out.println(str);
        /*str = " ";
        System.out.println(str);*/
        System.out.println("Хорошо идут дела Изучаю Java я!");
        System.out.println("Изучаю Java я! Хорошо идут дела");
    }

    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    /*2.1. Реализовать функцию public static int subtraction(int x, int y) в которой:
возвращать разницу x и y;
вывести на консоль следующий текст:
Вызвана функция subtraction() с параметрами x = ?, y = ?
где вместо знаков вопроса будут реальные значения.*/
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    public static int subtraction(int x, int y) {

        System.out.println("Вызвана функция subtraction() с параметрами" + " x = " + x + "," + " y = " + y);
        return x - y;
    }

    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    /*2.2 Реализовать функцию public static int addition(int x, int y) которая будет:
возвращать сумму x и y;
выводить на консоль следующий текст:
Вызвана функция addition() с параметрами x = ?, y = ?
где вместо знаков вопроса будут реальные значения.*/
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    public static int addition(int x, int y) {

        System.out.println("Вызвана функция addition() с параметрами" + " x = " + x + "," + " y = " + y);
        return x + y;
    }

    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    /*2.3 Реализовать функцию public static int multiplication(int x, int y) которая будет:
возвращать произведение x и y;
выводить на консоль следующий текст:
Вызвана функция multiplication() с параметрами x = ?, y = ?
где вместо знаков вопроса будут реальные значения.*/
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    public static int multiplication(int x, int y) {

        System.out.println("Вызвана функция multiplication() с параметрами" + " x = " + x + "," + " y = " + y);
        return x * y;
    }

    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    /*2.4 Реализовать функцию public static void calculation() в которой следует:
объявить переменные типа int с названиями a, b, c;
переменной a присвоить значение 34, переменной b присвоить значение 55;
вывести значения переменных a и b на консоль так:
a = ?
b = ?
где вместо знаков вопроса будут их реальные значения;*/
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    public static void calculation() {

        //int a, b, c;
        int a = 34;
        int b = 55;
        int c;
        System.out.println("a = " + a);
        System.out.println("b = " + b);

        /*после этого присвоить переменной c значение возвращённое функцией addition(), вызванной с параметрами x=a, y=b;
и вывести значения переменной c на консоль так:
a + b = ?
где вместо знака вопроса будет значение переменной c;*/
        //  addition(a, b);
        c = addition(a, b);
        System.out.println("a + b = " + c);

        /*после этого присвоить переменной c значение возвращённое функцией subtraction(), вызванной с параметрами x=a, y=b;
и вывести значения переменной c на консоль так:
a - b = ?
где вместо знака вопроса будет значение переменной c;*/
        //c = subtraction(a,b);
        System.out.println("a - b = " + subtraction(a, b));

        /*после этого присвоить переменной c значение возвращённое функцией multiplication(), вызванной с параметрами x=a, y=b;
и вывести значения переменной c на консоль так:
a * b = ?
где вместо знака вопроса будет значение переменной c.*/
        System.out.println("a * b = " + multiplication(a, b));
    }

    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    /*3. Реализовать функцию public static void main(String[] args) в которой:
- вызвать функцию printJava()
- вызвать функцию substruction() c параметрами 45 и 12
- вызвать функцию substruction() c параметрами 23 и 55
- вызвать функцию addition() c параметрами 128 и 787
- вызвать функцию addition() c параметрами 528 и 387
- вызвать функцию multiplication() c параметрами 124 и 87
- вызвать функцию multiplication() c параметрами 1528 и 3*/
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    public static void main(String[] args) {

        printJava();
        subtraction(45, 12);
        subtraction(23, 55);
        addition(128, 787);
        addition(528, 387);
        multiplication(124, 87);
        multiplication(1528, 3);
        // calculation();
    }
}



/*class Main {
    public static void main(String[] args) {
        Task2.printJava();
    }
}*/
