package com.javarush.task.task01.task0110;

/*Объяви переменную name типа String.
Сразу же в строке объявления присвой ей какое-нибудь значение.
Выведи на экран переменную name.

Требования:
•	В методе main объяви переменную типа String.
•	Имя переменной должно быть name.
•	Переменной сразу должно быть присвоено значение.
•	Программа должна выводить текст на экран.
•	Выведенный текст должен быть значением переменной.*/

/*
На нашем экране — переменная
*/

public class Solution {
    public static void main(String[] args) {
        //напишите тут ваш код
        String name ="Hello javarush" ;
        System.out.println (name);

    }
}

