package com.javarush;

public class Coments {
    public static void main(String[] args) {

        /*
        Сейчас мы выведем на экран фразу 'Amigo Is The Best'
        */
        System.out.print("Amigo ");
        System.out.print("Is ");
        System.out.print("The ");
        System.out.print("Best");

        System.out.println("");
        //--------------------------------------
        System.out.print("Amigo ");
        System.out.print("The "); //вот тут еще один комментарий
        System.out.print("Best");
    }
}


//— Да. Обычно в коде пишут различные комментарии к его неочевидным или сложным для понимания частям.
// Бывают комментарии на десятки строк, такие обычно пишут перед методами, в которых описывают нюансы работы методов.


//Иногда, кстати, в коде попадаются очень интересные комментарии:

// Я не отвечаю за этот код. Меня заставили написать его против моего желания.
// Дорогой я_из_будущего! Пожалуйста, прости меня за этот код.

// Если это условие когда-нибудь выполнится, пожалуйста,
// сообщите мне по тел. ххх-ххх-ххх за вознаграждение.

// Дорогой программист:
// Когда ты закончишь «оптимизировать» эту подпрограмму
// и поймешь, насколько большой ошибкой было делать это,
// пожалуйста, увеличь счетчик внизу как предупреждение
// для следующего парня:
// количество_часов_потраченных_здесь = 42

// Когда я начинал это писать, только Бог и я понимали, что я делаю
// Сейчас остался только Бог

// иногда мне кажется, что компилятор игнорирует все мои комментарии

// пьян, исправить позже
// Магия. Не трогать.

// прокомментировать позже





