package com.javarush.task.task04.task0426;

/*Ввести с клавиатуры целое число. Вывести на экран его строку-описание следующего вида:
"отрицательное четное числоо" - если число отрицательное и четное,
"отрицательное нечетное число" - если число отрицательное и нечетное,
"ноль" - если число равно 0,
"положительное четное число" - если число положительное и четное,
"положительное нечетное число" - если число положительное и нечетное.

Пример для числа 100:
положительное четное число

Пример для числа -51:
отрицательное нечетное число

Требования:
•	Программа должна считывать число c клавиатуры.
•	Программа должна использовать команду System.out.println() или System.out.print().
•	Если число отрицательное и четное, вывести "отрицательное четное число".
•	Если число отрицательное и нечетное, вывести "отрицательное нечетное число".
•	Если число равно 0, вывести "ноль".
•	Если число положительное и четное, вывести "положительное четное число".
•	Если число положительное и нечетное, вывести "положительное нечетное число".*/

/*
Ярлыки и числа
*/

import java.io.BufferedReader;
import java.io.InputStreamReader;

public class Solution {
    public static void main(String[] args) throws Exception {

        BufferedReader reader = new BufferedReader(new InputStreamReader(System.in));
        int a = Integer.parseInt(reader.readLine());
        System.out.println(
                a < 0 && a % 2 == 0 ? "отрицательное четное число" :
                        a < 0 && a % 2 != 0 ? "отрицательное нечетное число" :
                                a > 0 && a % 2 != 0 ? "положительное нечетное число" :
                                        a > 0 && a % 2 == 0 ? "положительное четное число" : "ноль");
    }
}