package Warehouse;

//текст взят отсюда
//https://zen.yandex.ru/media/umapalata/10-citat-na-latyni-kotorye-doljen-znat-kajdyi-5d062a9a4077f40d648bc4f9

//тут еще цитаты https://aforisma.ru/latinskie-vyrazhenia/
//10 цитат на латыни, которые должен знать каждый

// TODO: 30.01.2020 просто текст, форматировать нужно
//что то не охото форматировать...
//не охото все равно..
public class Quote {

    public static int verse = 2;

    public static void main(String[] args) {

        switch (verse) {

            case 1:
                System.out.println("Per aspera ad astra — одно из самых известных высказываний, которые вы часто могли слышать." + "\n" +
                        " С латинского — \"Через тернии к звёздам\"." +"\n"+
                        " Также используется вариант ad astra per aspera — буквально \"К звёздам через тернии\"." + "\n" +
                        " Второй вариант, пожалуй, даже более известен. Смысл прост: через трудности к великой цели.\n" +
                        "Авторство этому изречению приписывают Луцию Аннею Сенеке, Сенеке Младшему или просто Сенеке," + "\n"+
                        " древнеримскому философу, мыслителю," + "\n" +
                        " поэту и государственному деятелю Сенека также был воспитателем Нерона." +"\n"+
                        " Фраза из трагедии «Неистовый Геркулес» (441). " +"\n"+
                        "Полностью звучит так: Non est ad astra mollis e terris via «Не гладок путь от земли к звездам». " +"\n"+
                        "Также встречаются отсылки в авторстве к Гесиоду.");
                break;
            case 2:
                System.out.println("Errare humanum est — латинское изречение. «Человеку свойственно ошибаться»." +"\n" +
                        " Среди цитат на латыни — эта встречается довольно часто, в том числе в кино. Ее вы могли слышать" +"\n" +
                        " и в фильме «Место встречи изменить нельзя» (фразу произнес Иван Сергеевич Груздев), " +"\n" +
                        "и в фильме «Собака Баскервилей» из серии про Приключения Шерлока Холмса…" +"\n" +
                        " (фразу произнес доктор Ватсон, а перевел доктор Мортимер)…\n" +
                        "Афоризм Сенеки Старшего (отца Сенеки Стоика). Буквально звучит так: Ошибаться — есть человеческое (свойство)." +"\n" +
                        " Смысл прост: Только Бог не ошибается, Он милостив и прощает нас, а свойство человека — ошибаться." +"\n" +
                        " Для человека — это естественно…");
                break;
            case 3:
                System.out.println("Tempora mutantur et nos mutamur in illis — (латин.) «Времена меняются и мы меняемся вместе с ними» (или меняемся в них). Фраза не встречается в классической латыни, но представляет собой вариант фраз римского поэта Овидия , которому иногда неправильно присваиваются. Вместо этого выражение относится к ранней (середина XVI века) протестантской реформации, возникшей в Германии и впоследствии популяризировалось в различных формах.\n" +
                        "\n" +
                        "Как многие пословицы, пришедшие из латинской культуры эта фраза представляет собой гексаметр: ритмический стих, типичный для великой эпической поэзии, как в греческой, так и в латинской литературе. Также звучит в фильме «Собака Баскервилей», (фразу произнес доктор Мортимер).");
                break;
            case 4:
                System.out.println("Memento mori (лат. mementō morī «помни, что [придётся] умереть», «помни о смерти», «помни, что смертен») — латинское выражение, ставшее крылатой фразой. В Древнем Риме эта фраза произносилась во время триумфального шествия римских полководцев, возвращающихся с победой. За спиной военачальника ставили раба, который обязан был периодически напоминать триумфатору, что несмотря на свою славу, тот остаётся смертным. Вероятно, настоящая фраза звучала как: Respice post te! Hominem te memento! («Обернись! Помни, что ты — человек!») (глава 33 «Апологетики» Тертуллиана).");
                break;
            case 5:
                System.out.println("Exceptio probat (confirmat) regulam (лат.) — «Исключение доказывает (подтверждает) правило.» Идея родилась из защиты Цицероном Люция Корнелия Бальба Старшего (испанца по происхождению), которого обвиняли в незаконном получении римского гражданства. Обвинитель привёл примеры договоров Рима с некоторыми племенами, которые запрещали давать их членам гражданство и предложил сделать вывод, что гадитанцам (от испанского города Гадес — теперешний Кадис) гражданства тоже давать нельзя. На что Цицерон возразил: «Quod si exceptio facit ne liceat, ubi non sit exceptum, ibi necesse est licere» — («Поскольку это исключение делает принятие в гражданство незаконным, то отсутствие такого исключения необходимо делает его законным»).\n" +
                        "\n" +
                        "В средние века юристы обобщили этот принцип до «exceptio probat regulam in casibus non exceptis» («исключение подтверждает правило в неисключённых случаях») . То есть, если нескольким солдатам в порядке исключения дается разрешение вернуться в казарму позже обыкновенного, то данное обстоятельство означает, что «несмотря на наличие исключения, правило [для остальных солдат] остается в силе» . Смысл таков: в исключительных случаях правилами можно пренебречь, однако этот исключительный случай не отменяет правило.");
                break;
            case 6:
                System.out.println("Cui prodest? (лат.) - «Кому выгодно?» Используется вариант Cui bono? «Кто от этого выигрывает (кому впрок)?» Автор этой юридической формулы Луций Кассий Лонгин Равилла — консул Римской республики 127 года до н. э., происходивший из плебейской семьи Кассиев Лонгинов. Марк Туллий Цицерон в речи в защиту Секста Росция Америйского (“Pro Sex. Roscio Amerino oratio”, XXX, 84) сказал:\n" +
                        "«L. Cassius ille, quem populus Romanus verissimum et sapientissimum judicem putabat, identidem in causis quaerere solebat, “cui bono” fuisset. Sic vita hominum est, ut ad maleficium nemo conetur sine spe atque emolumento accedere». — («Знаменитый Луций Кассий, идеал справедливого и умного судьи в глазах римского народа, в уголовных процессах всегда ставил вопрос «кому впрок?». Таков уж характер людей, что никто не решается сделаться злодеем без расчета и пользы для себя»).\n" +
                        "\n" +
                        "Таким образом, Цицерон приписывает Кассию Равилле распространение выражения «cui bono?» (Кому выгодно? После Равиллы в Риме бытовало выражение «Кассиевы судьи», обозначавшее строгий, но справедливый суд.");
                break;
            case 7:
                System.out.println("Pecunia non olet — (лат.) «Деньги не пахнут». Вариант (Aes non olet) — «Медь не пахет» — латинское крылатое выражение. Слова, приписываемые императору Веспасиану, якобы произнесённые им после получения денег от налога на покупку мочи из общественных уборных Рима и обращённые к его сыну Титу, который выразил неудовольствие по этому поводу (мочу использовали при дублении кож, а также при стирке и отбеливании одежды).\n" +
                        "\n" +
                        "Туалетным налогом облагалось содержание и посещение общественных уборных, которые римские граждане использовали не только для отправления естественных надобностей, но и для общения. Необходимость как можно быстрее пополнить казну государства после только что закончившейся гражданской войны заставила Веспасиана вводить самые разные налоги и жестоко карать за попытки уклониться от их уплаты, что давало римлянам повод для злословий.\n" +
                        "\n" +
                        "Римский историк Гай Светоний Транквилл (70 — 140 г. н. э.) описывает диалог, состоявшийся между императором Веспасианом и его сыном Титом, так: Когда последний упрекнул отца в неблагородном происхождении денег, собранных путём введения налога на туалеты, император заставил сына понюхать монеты и спросил «Чем они пахнут?». «Ничем» — ответил сын. «Странно, а ведь они из мочи!» — поставил точку в диалоге император. Основанное на этой истории выражение «Деньги не пахнут» позднее стало поговоркой, указывающей на не вполне чистый источник доходов.");
                break;
            case 8:
                System.out.println("Nulla dies sine linea — латинский афоризм, который может быть дословно переведен как «Ни одного дня без линии». Традиционно переводится на русский язык как «Ни дня без строчки». Первым источником, где встречается выражение, является книга древнеримского историка Плиния Старшего, который приписывает выражение знаменитому древнегреческому художнику Апеллесу (IV в. до н. э.). Апеллес, со слов Плиния, старался практиковать графическое искусство, не пропуская ни дня. Плиний Старший сообщает, что живописец Апеллес «имел обыкновение, как бы он ни был занят, ни одного дня не пропускать, не упражняясь в своем искусстве, проводя хоть одну черту». Это и послужило основанием для поговорки.");
                break;
            case 9:
                System.out.println("O tempora! O mores! — (лат. [О тэ́мпора, о мо́рэс!]) «О времена, о нравы!». Самая известная из цитат на латыни, принадлежащая Цицерону. Это его выражение из «Первой речи против Катилины», которая считается вершиной римского ораторского искусства. Раскрывая подробности заговора Катилины на заседании сената в присутствии последнего, Цицерон этой фразой выражает возмущение как наглостью заговорщика, посмевшего как ни в чём не бывало явиться в сенат, так и бездействием властей относительно преступника, замышлявшего гибель Республики.\n" +
                        "\n" +
                        "Однако, есть версия, что изначально фраза принадлежит Катону. Катон Марк Порций (Катон Старший, он же — Катон Цензор, живший 234-ок. 148 до н. э.) — древнеримский политик, полководец и писатель.");
                break;
            case 10:
                System.out.println("Vēni. Vidi. Vici. — (лат.) [Вэ́ни. Ви́ди. Ви́ци] «Пришел. Увидел. Победил.» Среди цитат на латыни эта цитата довольна известна, особенно сегодня. По свидетельству Плутарха, этой фразой Юлий Цезарь сообщил в письме к своему другу Аминтию о быстрой победе при Зеле над понтийским царем Фарнаком в августе 47 г. до н. э. Светоний сообщает, что эта фраза была начертана на доске, которую несли перед Цезарем во время понтийского триумфа. Этим Цезарь отмечал не события войны, как обычно, а стремительность её завершения.");
                break;
        }


    }
}
