package Warehouse;

//  + "\n"+  пригодился  - перенос строки
public class Quote_1 {

    public static String str = "";
    public static int verse = 1;
    public static void main(String[] args) {

        switch (verse) {
            case 1:
                str = "Per aspera ad astra — одно из самых известных высказываний, которые вы часто могли слышать." +  "\n" +
                        " С латинского — \"Через тернии к звёздам\". Также используется вариант ad astra per aspera" +   "\n"+
                        " — буквально \"К звёздам через тернии\". Второй вариант, пожалуй, даже более известен." + "\n"+
                        "" +
                        " Смысл прост: через трудности к великой цели.\n" +

                        "Авторство этому изречению приписывают Луцию Аннею Сенеке, Сенеке Младшему или просто Сенеке," + "\n"+
                        " древнеримскому философу, мыслителю, поэту и государственному деятелю Сенека также был воспитателем Нерона." +  "\n"+
                        " Фраза из трагедии «Неистовый Геркулес» (441).  " +  "\n"+
                        "Полностью звучит так: Non est ad astra mollis e terris via «Не гладок путь от земли к звездам»." +  "\n"+
                        " Также встречаются отсылки в авторстве к Гесиоду.";
                System.out.println(str);
                break;

            case 2:
                str = "\n" +
                        "Per aspera ad astra — одно из самых известных высказываний, которые вы часто могли слышать. С латинского — \"Через тернии к звёздам\". Также используется вариант ad astra per aspera — буквально \"К звёздам через тернии\". Второй вариант, пожалуй, даже более известен. Смысл прост: через трудности к великой цели.\n" +
                        "\n" +
                        "Авторство этому изречению приписывают Луцию Аннею Сенеке, Сенеке Младшему или просто Сенеке, древнеримскому философу, мыслителю, поэту и государственному деятелю Сенека также был воспитателем Нерона. Фраза из трагедии «Неистовый Геркулес» (441). Полностью звучит так: Non est ad astra mollis e terris via «Не гладок путь от земли к звездам». Также встречаются отсылки в авторстве к Гесиоду.";
                System.out.println(str);
                break;

            case 3:
                str = "Per aspera ad astra — одно из самых известных высказываний, которые вы часто могли слышать." +
                        " С латинского — \"Через тернии к звёздам\". Также используется вариант ad astra per aspera" +
                        " — буквально \"К звёздам через тернии\". Второй вариант, пожалуй, даже более известен." +
                        "" +
                        " Смысл прост: через трудности к великой цели.\n" +
                        "\n" +
                        "Авторство этому изречению приписывают Луцию Аннею Сенеке, Сенеке Младшему или просто Сенеке," +
                        " древнеримскому философу, мыслителю, поэту и государственному деятелю Сенека также был воспитателем Нерона." +
                        " Фраза из трагедии «Неистовый Геркулес» (441). Полностью звучит так: Non est ad astra mollis e terris via «Не гладок путь от земли к звездам»." +
                        " Также встречаются отсылки в авторстве к Гесиоду.";
                System.out.println(str);
                break;

        }

    }
}

