package ru.progwards.java1.lessons.basics;

public class Astronomy {

/*В этой задаче нужно будет реализовать функции, вычисляющих разные астрономические величины.
Во всех функциях, где это необходимо, считаем число π = 3.14 */

//v2
    private static double getPI() {
        return PI;
    }

    private static final double PI = 3.14d;

    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
                                        /*2.1 Реализовать функцию
                                    public static Double sphereSquare(Double r),
                          которая вычисляет площадь поверхности сферы радиуса R по формуле S = 4πR2.*/
    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    public static Double sphereSquare(Double r) {
        return 4 * getPI() * r * r;
    }

    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
                                /*2.2 Реализовать функцию
                            public static Double earthSquare(), которая вычисляет площадь поверхности Земли,
                            считая радиус равным 6 371.2 км и используют функцию sphereSquare*/
    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    public static Double earthSquare() {
        return sphereSquare(6371.2);
    }

    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
                                /*2.3 Реализовать функцию
                            public static Double mercurySquare(), которая вычисляет площадь поверхности Меркурия,
                            считая радиус равным 2 439,7 км  и используют функцию sphereSquare*/
    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    public static Double mercurySquare() {
        return sphereSquare(2439.7);
    }

    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
                                /*2.4Реализовать функцию
                        public static Double jupiterSquare(),которая вычисляет площадь поверхности Юпитера,
                        считая радиус равным 71 492км и используют функцию sphereSquare*/
    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    public static Double jupiterSquare() {
        return sphereSquare(71492.0);
    }

    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
                              /*2.5Реализовать функцию
                    public static Double earthVsMercury(),которая вычисляет отношение площади поверхности Земли
                     к площади поверхности Меркурия используя готовые функции площадей планет*/
    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    public static Double earthVsMercury() {
        return earthSquare() / mercurySquare();
    }

    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
                        /*2.6Реализовать функцию
                        public static Double earthVsJupiter(),которая вычисляет отношение площади поверхности Земли
                        к площади поверхности Юпитера используя готовые функции площадей планет*/
    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    public static Double earthVsJupiter() {
        return earthSquare() / jupiterSquare();
    }
}


