package com.javarush.task.task01.task0118;

/*Закомментируй часть кода, чтобы на экран вывелось сообщение "sum = 12"

Требования:
•	Программа должна выводить на экран текст.
•	Нужно закомментировать необходимые строки и не менять остальные.
•	В программу нельзя добавлять новые строки или удалять имеющиеся.
•	Выведенный текст должен соответствовать заданию.*/

/*
Закомментируйте лишнее
*/

public class Solution {
    public static void main(String[] args) {
        int a = 3;
        //int a = 10;
        int b = 6;
        //int b = 12;
        // int sum = 1 + a + b;
        // int sum = 2 + a + b;
        int sum = 3 + a + b;
        // int sum = 4 + a + b;
        System.out.println("sum = " + sum);
    }
}

