package com.javarush.level01;

public class lecture03 {

    String s;  //Эта строчка создаст переменную по имени s с типом хранимых в ней данных — текст (String — строка).
    //Мы не можем объявить другую переменную с таким же именем в этой же функции или классе

    String s2 = "I'm Diego"; //Эта строчка создаст переменную по имени s2 с типом данных текст (строка) и сразу занесёт в неё значение "I'm Diego".

    int a; //Создаём переменную по имени a с типом хранимых в ней данных – целое число (Integer, сокращённо int).

    int b = 4; //Создаём переменную по имени b с типом хранимых целых чисел (int). В переменную сразу заносится значение 4.


    public static void main(String[] args) {

    }
}
