package ru.progwards.t1;

/*Создайте класс с именем CalcAndText в котором разместите функцию main, которая выводит информацию на консоль, используя сложение чисел и строк, следующую информацию

12 + 34 + 48 = <результат вычислений>
33 + 44 + 55 = <результат вычислений>
98 + 99 + 97 = <результат вычислений>

*/
public class CalcAndText {
    public static void main(String[] args) {
        System.out.print("12 + 34 + 48 = ");
        System.out.println(12 + 34 + 48);
        System.out.print("33 + 44 + 55 = ");
        System.out.println(33 + 44 + 55);
        System.out.print("98 + 99 + 97 = ");
        System.out.println(98 + 99 + 97);
    }
}

