package ru.progwards.t1;

//Создайте класс с именем Russia в котором разместите функцию main, которая выводит информацию на консоль, используя сложение чисел и строк, следующую информацию:
//
//Площадь России 17125191 квадратных километров
//Население России 146780720 человек
//ВВП (ППС) России 28797$ на душу населения
//ВВП (номинал) России 11289$ на душу населения

public class Russia {
    public static void main(String[] args) {
        System.out.println("Площадь России " + 17125191 + " квадратных километров");
        System.out.println("Население России " + 146780720 + " человек");
        System.out.println("ВВП (ППС) России " + 28797 + "$" + " на душу населения");
        System.out.println("ВВП (номинал) России " + 11289 + "$" + " на душу населения");
    }
}


