package ru.progwards.t1;

//Создайте класс Java с функцией main выводящей на консоль следующий текст:
//
//class это программа на Java

/*          public class Java {
            public static void main(String[]args) {
                System.out.println("class это программа на Java");
            }
            */

public class Task_06 {

    public static void main(String[] args) {

        System.out.println("class это программа на Java");
    }
}

