package ru.progwards.t1;

//Выведите на консоль в одну строку, используя 3 оператора вывода print следующие фрагменты текста:
//
//Java это
//строго типизированный объектно-ориентированный
//язык программирования

public class Task_03 {
    public static void main(String[] args) {
        System.out.print("Java это ");
        System.out.print("строго типизированный объектно-ориентированный");
        System.out.print(" язык программирования");
    }
}
