package ru.progwards.t1;

//Напишите программный код, выводящий на консоль
//Hello World!

public class Task_01 {
    public static void main(String[] args) {
        System.out.println("Hello World!");
    }
}
