package ru.progwards.t1;

//Выведите на консоль, используя строковый, целый тип, и операцию сложения следующий текст
//
//289468 + 56624 + 88464 = <результат вычислений>
//
//
//Вместо <результат вычислений> должно быть выведена подсчитанная компьютером сумма

public class Task_04 {
    public static void main(String[] args) {
        System.out.print("289468" + " + 56624" + " + 88464 = ");
        System.out.println(289468 + 56624 + 88464);
    }
}
