package ru.progwards.t1;

//Выведите на консоль следующий текст
//
//Изучать Java это интересно
//Изучать Java это полезно
//Изучать Java это не сложно

public class Task_02 {
    public static void main(String[] args) {
        System.out.println("Изучать Java это интересно");
        System.out.println("Изучать Java это полезно");
        System.out.println("Изучать Java это не сложно");
    }
}
