package Warehouse.dump.java1.lessons.register1;


/*
* Класс Bit
Реализовать класс, содержащий один бит. Внутри данные хранить в переменной типа boolean, методы:

public Bit()

public Bit(boolean value)
* */

// TODO: 17.12.2019
public class Bit {



    public Bit() {

        boolean value = true;
    }

    public Bit(boolean value) {
    }

    public String toString() {    //должен выводить 1 или 0

    if(true) {
      System.out.println(1);
  }
        System.out.println(0);
    return null;
    }

    public static void main(String[] args) {

    }
}
