package com.javarush.task.task01.task0126;

/*Напиши программу, которая выводит на экран надпись: "Хочешь - решай задачи, не хочешь - решай нехотя" 16 раз.

Требования:
•	Программа должна выводить текст.
•	Текст должен начинаться с "Хочешь".
•	Текст должен заканчиваться на "нехотя".
•	Текст должен состоять из 16 строк.
•	Выводимый текст должен соответствовать заданию.*/

/*
Не хочешь  - решай нехотя
*/

public class Solution {
    public static void main(String[] args) {
        //напишите тут ваш код
        for (int i = 0; i < 16; i++) {
            System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        }
    }
}
