package com.javarush.task.task01.task0139;

/*- Амиго, ты хочешь стать программистом?
- Ещё бы!
- Тогда быстрее пиши программу, которая выводит на экран фразу "Hello World!".
- Но… Это как-то банально!
- Именно. Амиго, твои мысли совпадают с моими, и это – отлично. Поэтому лучше выведи фразу, которую нам, роботам, стоит повторять в моменты неуверенности. Вот она: "Поцелуй мой блестящий металлический зад!"

Требования:
•	Программа должна выводить текст.
•	Текст должен начинаться с "Поцелуй".
•	Текст должен заканчиваться знаком восклицания.
•	Текст должен состоять из 40 символов, включая пробелы и знак восклицания.
•	Выводимый текст должен соответствовать заданию.*/

/*
Лучше поздно, чем никогда: Hello world!
*/

public class Solution {
    public static void main(String[] args) {
        //напишите тут ваш код
        System.out.println ("Поцелуй мой блестящий металлический зад!");
    }
}