package Warehouse.Anekdots;

public class Anekdot {

    public static String str = "Случилось как то наводнение. Все спасаются, кто как может, и только старый, очень набожный еврей сидит и молится.\n" +
            "Мимо проезжает грузовик, сидящие в кузове кричат:\n" +
            "— Хаим, полезай в кузов, спасайся!\n" +
            "— Я всю жизнь молился и соблюдал все традиции, меня Бог спасет — отвечает Хаим.\n" +
            "Вода доходит уже до окон. Мимо проплывает лодка. Тот же вопрос и тот же ответ.\n" +
            "Вода доходит до крыши, Хаим сидит на крыше и молится.\n" +
            "Спускается с неба вертолет. Тот же вопрос, тот же ответ. И Хаим утонул.\n" +
            "И уже в другом мире стал попрекать Бога:\n" +
            "— Я всю жизнь молился и соблюдал все традиции, почему же Ты меня не спас?\n" +
            "— Я тебе и машину, и лодку, и вертолет посылал, так в чем же дело?" ;
    public static void main(String[] args) {

        System.out.println(str);

    }
}
