package Warehouse.anekdots;

public class ForProgrammers {

    String s1 = "Один программист, радостно: — Я тут с девушкой познакомился — красивая, обалдеть! Второй, настороженно: — А ты ее во всех браузерах видел?" ;

    String s2 = "— Сколько программистов нужно, чтобы сменить перегоревшую лампочку? — Ни одного. Это Hardware Problem." ;

    String str = "Создали ученые суперкомпьютер (ну этот комп по идее должен был на любые вопросы ответить), ну и задают значит ему вопрос:\n" +
            "— Есть ли Бог?\n" +
            "Комп подумал немного, пожужжал и отвечает:\n" +
            "— Недостаточно информации, подсоедините меня ко всем другим мощнейшим компам планеты.\n" +
            "Ну ученые повздыхали, а делать нечего, подсоединили. Опять спрашивают:\n" +
            "— Есть ли Бог?\n" +
            "Комп опять подумал пожужжал и отвечает:\n" +
            "— Недостаточно информации. Подсоедините меня ко всем компам планеты вообще.\n" +
            "Ученым трудно было это сделать, но они все-таки подсоединили суперкомп ко всем компам планеты вообще. Опять задают тот же вопрос. Комп пожужжал и говорит:\n" +
            "— Недостаточно информации. Подсоедините меня ко всем электронным сетям, ко всем приборам на процессорах, и т.п.\n" +
            "Ну ученые разбились в лепешку, но и это сделали. Опять задают:\n" +
            "— Есть ли Бог?\n" +
            "Комп:\n" +
            "— Теперь есть." ;
}
