package ru.progwards.java1_1.java1.lessons.test;

//Задача 1. Класс Test1

public class Test1 {

    public static void main(String[] args) {

     /*1.1 Реализовать функцию public static void main(String[] args) в которой следует: вывести на консоль,
     используя функцию System.out.print() следующий текст:
     Сделаю коммит, запушу в репо: робот, проверяй теперь всё это...*/

        System.out.print("Сделаю коммит, запушу в репо: робот, проверяй теперь всё это...");
    }
}
