package Warehouse.dump.java1.lessons.bitsworld;

/*Задача 3. Класс Binary
3.1 Реализовать конструктор
public Binary(byte num).
3.2 Реализовать метод
public String toString(), который возвращает двоичное представление числа типа byte, используя только битовые операции. В выводимом значении всегда должно быть 8 символов
Например:
0: "00000000"
1: "00000001"
127: "01111111"
-128: "10000000"
-1: "11111111"
*/


public class Binary {

    public Binary(byte num) {
    }

    public String toString() {
        return null;
    }

    public static void main(String[] args) {
    }
}

// TODO: 01.02.2020 бот вроде оценил творчество...видимо с ошибкой
//byte - 1 байт = 8 бит
/*Задача 3. Класс Binary: пройдено, оценка: 18.0
Комментарий:
OK: Тест "Конструктор Binary(int num)" пройден успешно.
OK: Тест "Метод toString()" пройден успешно.
По данной задаче в целом зачет, решение принято. Задача выполнена на 100.00%
*/