package com.javarush.task.task02.task0207;

/*В методе main объяви две переменные a и b типа int.
Присвой им любые значения.
Выведи на экран их сумму и произведение.
Каждое значение выводить с новой строки.

Пример вывода на экран для а = 5, b = 7:
12
35

Требования:
•	Программа должна выводить текст на экран.
•	В программе должны быть только две переменные: a и b типа int.
•	Переменным сразу должны быть присвоены значения.
•	Метод main должен выводить на экран сумму переменных a и b.
•	Метод main должен выводить на экран произведение переменных a и b.
•	Каждое значение должно быть выведено с новой строки*/


/*
Кусочек калькулятора
*/
public class Solution {
    public static void main(String[] args) {
        //напишите тут ваш код

        int a = 3, b = 5;
        System.out.print("Сумма чисел " + (a + b) + " a+b\n" + "Произведение чисел " + (a * b) + " a*b\n");

        //   System.out.println(a+b + "\n"+a*b);
    }
}

