package JavaRush;
//— Минимальная программа не содержит ни одной команды. На то она и минимальная.
public class MinimumProgram {
    public static void main(String[] args) {
    }
}

//— Класс, с которого начинается программа, может иметь любое имя


/*Имена классов: начинаются с большой буквы и должны состоять из существительных, типа BuildingList в стиле CamelCase
Имена интерфейсов: начинаются с большой буквы и должно быть прилагательным, типа: Buildable - тоже в стиле CamelCase
Имена методов: начинаются с маленькой буквы и должны быть глаголами (в стиле CamelCase), типа: buildList
Имена переменных: начинаются с маленькой буквы, типа: myList - в стиле CamelCase
Имена пакетов: все маленькими буквами, типа: com.builder.list - не в стиле CamelCase, принято именовать пакеты доменным именем владельца, типа: ru.padawan.builder.list, хорошим тоном считается регистрация своего доменного имени и активно применять свое доменное имя с именами пакетов.
Имена констант: все большими буквами, типа: MY_LIST_CONSTANT - стиль CamelCase не применяется, слова разделяются нижним подчеркиванием.
CamelCase (буквально верблюжий регистр) - это когда каждое новое слово пишется с большой буквы, типа: HereIsCamelCaseExampleName - ЭтоПримерВерблюжьегоСтиляИменования*/