package ru.progwards.java1_1.java1.lessons.bitsworld;

/*
Подсказки:
при реализации этой функции следует использывать опыт, полученный при решении предыдущей задачи;
кроме того, удобно использовать битовую операцию сдвиг вправо >>.
*/
public class CheckBit {

    //////////////////////////////////////////////////////////////////////////////////////////////
    /*2.1 Реализовать функцию public static int checkBit(byte value, int bitNumber)
     которая возвращает значение бита с порядковым номером bitNumber от параметра value.
      При этом следует помнить, что нумерация начинается с нуля и нулевой бит является младшим.*/
    //////////////////////////////////////////////////////////////////////////////////////////////

    public static int checkBit(byte value, int bitNumber) {
        return (value >> bitNumber) & 0b00000001;
    }
}
