package ru.progwards.java1.lessons.compare_if_cycles;


public class CyclesGoldenFibo {
    /*
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
            3.1 Реализовать функцию
        public static boolean containsDigit(int number, int digit), которая будет возвращать true,
        если число number содержит цифру digit.
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
        */
    public static boolean containsDigit(int number, int digit) {
        if (number <= 9 && number >= 0 && number == digit) {
            return true;
        } else
            return false;
    }

    /*Теперь проведём исследование. Есть ли у Золотого треугольника связь с числами Фибоначчи.
        Золотой треугольник это равнобедренный треугольник у которого ребро относится к основанию как 1.61803
        (приблизительно), то есть по правилу Золотого сечения. Числа Фибоначчи это ряд чисел
         1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, ...
         в котором первые два элемента равны 1
        , а каждый следующий равен сумме двух предыдущих.
        Для проведения этого исследования нам придётся решить две задачи.*/

    /*
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
        3.2 Реализовать, используя любой цикл, функцию
        public static int fiboNumber(int n), которая будет возвращать n-ое число Фибоначчи (нумерация начинается с 1,
        то есть при n = 3 должно вернуться число Фибоначчи 2, а при n = 10 число 55).
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
     */
    public static int fiboNumber(int n) { //OK:

        if (n == 1) {
            return 1;
        } else if (n == 2) {
            return 1;
        } else {
            return fiboNumber(n - 1) + fiboNumber(n - 2);
        }
    }

    /*
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
        3.3 Реализовать функцию
      public static boolean isGoldenTriangle(int a, int b, int c), которая будет возвращать true, если треугольник
      со сторонами a, b, c является Золотым. Определим критерии. Он должен быть равнобедренным и отношение ребра
      к основанию должно лежать между значениями 1.61703 и 1.61903.
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
  */
    public static boolean isGoldenTriangle(int a, int b, int c) {

        boolean gold = false; //default false;

        double value1 = 1.61703;
        double value2 = 1.61903;

        double a1 = (double) a;
        double b1 = (double) b;
        double c1 = (double) c;

        double ab = a1 / c1;
        double ac = a1 / b1;
        double bc = b1 / a1;

        if (a == b) {
            if (ab > value1 && ab < value2) {
                System.out.println("Золотой треугольник!" + a + " " + b + " " + c);
                gold = true;
            }
        }

        if (a == c) {
            if (ac > value1 && ac < value2) {
                System.out.println("Золотой треугольник!" + a + " " + b + " " + c);
                gold = true;
            }
        }

        if (b == c) {
            if (bc > value1 && bc < value2) {
                System.out.println("Золотой треугольник!" + a + " " + b + " " + c);
                gold = true;
            }
        }
        return gold;
    }

    /*
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
    Далее в функции public static void main(String[] args) вывести на консоль, используя цикл, 15 первых
    чисел Фибоначчи. После этого, используя вложенные циклы, определить: есть ли среди треугольников, длины
    сторон которых являются натуральными числами не превышающими 100, Золотые треугольники. И если есть,
    вывести на консоль длины основания и рёбер этих треугольников.
    Если всё получилось, посмотрите на консоль и сделайте вывод: есть ли связь между числами Фибоначчи и
    Золотыми треугольниками
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
*/
    public static void main(String[] args) {
        System.out.println(fiboNumber(15));
    }
}




